---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.WallFailures
source: html/85dd4642-dcc6-f639-dd17-00f7574992d8.htm
---
# BuiltInFailures.WallFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.